{
  "foodposts": [
    {
      "id": 1,
      "title": "Tandoori chicken",
      "imgThumb": "/images/chicken.jpg",
      "recipes": "Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.",
      "ingredient": {
        "lemons": "2 Juice",
        "paprika": "4 tsp",
        "red onions": "2 finely chopped",
        "chicken thighs": "16 skinnless",
        "vegetable oil": "For brushing",
        "Greek yogurt": "300ml",
        "ginger": "large piece",
        "garam masala": "¾ tsp"
      }
    },
    {
      "id": 2,
      "title": "Shrimp Chow Fun",
      "imgThumb": "/images/seafood.jpg",
      "recipes": "STEP 1 - SOAK THE RICE NOODLES\r\nSoak the rice noodles overnight untill they are soft\r\nSTEP 2 - BOIL THE RICE NOODLES\r\nBoil the noodles for 10-15 minutes and then rinse with cold water to stop the cooking process of the noodles.\r\nSTEP 3 -MARINATING THE SHRIMP\r\nIn a bowl add the shrimp, egg, 1 pinch of white pepper, 1 Teaspoon of sesame seed oil, 1 Tablespoon corn starch and 1 tablespoon of oil\r\nMix together well\r\nSTEP 4 - STIR FRY\r\nIn a wok add 2 Tablespoons of oil, shrimp and stir fry them until it is golden brown\r\nSet the shrimp aside\r\nAdd 1 Tablespoon of oil to the work and then add minced garlic, ginger and all of the vegetables.\r\nAdd the noodles to the wok\r\nNext add sherry cooking wine, oyster sauce, sugar, vinegar, sesame seed oil, 1 pinch white pepper, and soy sauce\r\nAdd back in the shrimp\r\nTo thicken the sauce, whisk together 1 Tablespoon of corn starch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 3,
      "title": "English Breakfast",
      "imgThumb": "/images/breakfast.jpg",
      "recipes": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 4,
      "title": "Banana Pancake",
      "imgThumb": "/images/Banana-Pancake.jpg",
      "recipes": "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.\r\nHeat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries.",
      "ingredient": {
        "Banana": "1 large",
        "Eggs": "2 medium",
        "Baking Powder": "1/2",
        "Vanilla Extract": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Oil": "2 tbs",
        "Pecan Nutsc": "¾ tsp"
      }
    },
    {
      "id": 5,
      "title": "Steak Diane",
      "imgThumb": "/images/Steak-Diane.jpg",
      "recipes": "Heat oil in a 12\" skillet over medium-high heat. Season steaks with salt and pepper, and add to skillet; cook, turning once, until browned on both sides and cooked to desired doneness, about 4 to 5 minutes for medium-rare. Transfer steaks to a plate, and set aside.\r\nReturn skillet to high heat, and add stock; cook until reduced until to 1⁄2 cup, about 10 minutes. Pour into a bowl, and set aside. Return skillet to heat, and add butter; add garlic and shallots, and cook, stirring, until soft, about 2 minutes. Add mushrooms, and cook, stirring, until they release any liquid and it evaporates and mushrooms begin to brown, about 2 minutes. Add cognac, and light with a match to flambée; cook until flame dies down. Stir in reserved stock, cream, Dijon, Worcestershire, and hot sauce, and then return steaks to skillet; cook, turning in sauce, until warmed through and sauce is thickened, about 4 minutes. Transfer steak to serving plates and stir parsley and chives into sauce; pour sauce over steaks to serve.",
      "ingredient": {
        "Canola Oil": "2 tbs",
        "Beef Fillet": "4",
        "Beef Stock": "1 1/2 cup",
        "Butter": "2 tbs",
        "Garlic": "2 cloves minced",
        "Challots": "1 medium finely diced",
        "Mushrooms": "4 oz"
      }
    },
    {
      "id": 6,
      "title": "Cajun spiced fish tacos",
      "imgThumb": "/images/Cajun spiced fish tacos.jpg",
      "recipes": "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r\n\r\nOn a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r\n\r\nHeat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r\n\r\nMeanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r\nSoften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing",
      "ingredient": {
        "Cajun": "1/2 bag",
        "avocado": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 7,
      "title": "Fettucine alfredo",
      "imgThumb": "/images/pasta.jpg",
      "recipes": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
      "ingredient": {
        "Clotted Cream": "227g",
        "Butter": "25g",
        "Corn Flour": "1 tsp",
        "Parmesan Cheese": "100g",
        "Nutmeg": "2 tbs"
      }
    },
    {
      "id": 8,
      "title": "Treacle Tart",
      "imgThumb": "/images/Treacle Tart.jpg",
      "recipes": "First make the short crust pastry: measure the flour into a large bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs (alternatively, this can be done in a food processor). Add about three tablespoons of cold water and mix to a firm dough, wrap in cling film and chill in the fridge for about 20 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 and put a heavy baking tray in the oven to heat up. Grease a deep 18cm/7in loose-bottomed fluted flan tin with butter.\r\nRemove about 150g/5½oz of pastry from the main ball and set aside for the lattice top.\r\nRoll the rest of the pastry out thinly on a lightly floured work surface and line the prepared flan tin with the pastry.\r\nPrick the base with a fork, to stop the base rising up during baking.\r\nPlace the reserved pastry for the lattice top on cling film and roll out thinly. Egg wash the pastry and set aside to chill in the fridge (the cling film makes it easier to move about). Do not cut into strips at this stage. Do not egg wash the strips once they are on the tart as it will drip into the treacle mixture.\r\nTo make the filling, heat the syrup gently in a large pan but do not boil.\r\nOnce melted, add the breadcrumbs, lemon juice and zest to the syrup. (You can add less lemon if you would prefer less citrus taste.) If the mixture looks runny, add a few more breadcrumbs.\r\nPour the syrup mixture into the lined tin and level the surface.\r\nRemove the reserved pastry from the fridge and cut into long strips, 1cm/½in wide. Make sure they are all longer than the edges of the tart tin.\r\nEgg wash the edge of the pastry in the tin, and start to make the woven laying lattice pattern over the mixture, leave the strips hanging over the edge of the tin.\r\nOnce the lattice is in place, use the tin edge to cut off the strips by pressing down with your hands, creating a neat finish.\r\nBake on the pre-heated baking tray in the hot oven for about 10 minutes until the pastry has started to colour, and then reduce the oven temperature to 180C/350F/Gas 4. If at this stage the lattice seems to be getting too dark brown, cover the tart with tin foil.\r\nBake for a further 25-30 minutes until the pastry is golden-brown and the filling set.\r\nRemove the tart from the oven and leave to firm up in the tin. Serve warm or cold.",
      "ingredient": {
        "Plain Flour": "250g",
        "Butter": "135g",
        "Golden Syrup": "400g",
        "Breadcrumbs": "150g",
        "Lemons": "Zest of 2",
        "Eggs": "1 beaten"
      }
    },
    {
      "id": 9,
      "title": "Kedgeree",
      "imgThumb": "/images/Kedgeree.jpg",
      "recipes": "For the rice, heat the oil in a large, lidded pan, add the onion, then gently fry for 5 mins until softened but not coloured. Add the spices, season with salt, then continue to fry until the mix start to go brown and fragrant; about 3 mins.\r\nAdd the rice and stir in well. Add 600ml water, stir, then bring to the boil. Reduce to a simmer, then cover for 10 mins. Take off the heat and leave to stand, covered, for 10-15 mins more. The rice will be perfectly cooked if you do not lift the lid before the end of the cooking.\r\nMeanwhile, put the haddock and bay leaves in a frying pan, cover with the milk, then poach for 10 mins until the flesh flakes. Remove from the milk, peel away the skin, then flake the flesh into thumbsize pieces. Place the eggs in a pan, cover with water, bring to the boil, then reduce to a simmer. Leave for 4½-5 mins, plunge into cold water, then peel and cut the eggs into quarters. Gently mix the fish, eggs, parsley, coriander and rice together in the pan. Serve hot, sprinkled with a few extra herbs.",
      "ingredient": {
        "Smoked Haddock": "1/2 bag",
        "Bay Leaves": "8 oz",
        "Milk": "1/2",
        "Eggs": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 10,
      "title": "Coq au vin",
      "imgThumb": "/images/Coq au vin.jpg",
      "recipes": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.\r\nPat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.\r\nScatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.\r\nReturn the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.\r\nJust before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.\r\nLift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 11,
      "title": "Tamiya",
      "imgThumb": "/images/Tamiya.jpg",
      "recipes": "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.\r\nGrind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using.  Refrigerate for at least 30 minutes.\r\nShape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.\r\nHeat at least 1½-inches of oil over medium heat to 365 degrees.\r\nFry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce.",
      "ingredient": {
        "Broad Beans": "1/2 bag",
        "Spring Onions": "8 oz",
        "Garlic Clove": "1/2",
        "Parsley": "pinch",
        "Cumin": "2 tsp",
        "Baking Powder": "2 tbs"
      }
    },
    {
      "id": 12,
      "title": "Christmas Pudding Trifle",
      "imgThumb": "/images/Christmas Pudding Trifle.jpg",
      "recipes": "Peel the oranges using a sharp knife, ensuring all the pith is removed. Slice as thinly as possible and arrange over a dinner plate. Sprinkle with the demerara sugar followed by the Grand Marnier and set aside.\r\n\r\nCrumble the Christmas pudding into large pieces and scatter over the bottom of a trifle bowl. Lift the oranges onto the pudding in a layer and pour over any juices.\r\n\r\nBeat the mascarpone until smooth, then stir in the custard. Spoon the mixture over the top of the oranges.\r\n\r\nLightly whip the cream and spoon over the custard. Sprinkle with the flaked almonds and grated chocolate. You can make this a day in advance if you like, chill until ready to serve",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 13,
      "title": "Lamb Rogan josh",
      "imgThumb": "/images/Lamb Rogan josh.jpg",
      "recipes": "\r\nPut the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.\r\nTip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.\r\nCover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice.",
      "ingredient": {
        "Onion": "2 quartered",
        "Sunflower Oil": "4 tbsp",
        "Garlic": "4 cloves",
        "Ginger": "Thumb sized peeled and very finely grated",
        "Madras Paste": "2 tsp",
        "Paprika": "2 tbs",
        "Cardamom": "1"
      }
    },
    {
      "id": 14,
      "title": "Potato Gratin with Chicken",
      "imgThumb": "/images/Potato Gratin with Chicken.jpg",
      "recipes": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 15,
      "title": "Chocolate Souffle",
      "imgThumb": "/images/Chocolate Souffle.jpg",
      "recipes": "Heat oven to 220C/fan 200C/gas 7 and place a baking tray on the top shelf. For the sauce, heat the cream and sugar until boiling. Remove from the heat, stir in the chocolate and butter until melted, then keep warm.\r\nBrush 6 x 150ml ramekins with melted butter, sprinkle with the 2 tbsp caster sugar, then tip out any excess. Melt the chocolate and cream in a bowl over a pan of simmering water, cool, then mix in the egg yolks. Whisk the egg whites until they hold their shape, then add the sugar, 1 tbsp at a time, whisking back to the same consistency. Mix a spoonful into the chocolate, then gently fold in the rest.\r\nWorking quickly, fill the ramekins, wipe the rims clean and run your thumb around the edges. Turn oven down to 200C/fan 180C/gas 6, place the ramekins onto the baking tray, then bake for 8-10 mins until risen with a slight wobble. Don’t open the oven door too early as this may make them collapse.\r\nOnce the soufflés are ready, dust with icing sugar, scoop a small hole from their tops, then pour in some of the hot chocolate sauce. Replace the lids and serve straight away.",
      "ingredient": {
        "Single Cream": "1/2 bag",
        "Caster Sugar": "8 oz",
        "Dark Chocolate": "1/2",
        "Butter": "pinch",
        "Egg Yolks": "2 tsp",
        "Cornstarch": "2 tbs",
        "Double Cream": "2 tbs"
      }
    },
    {
      "id": 16,
      "title": "Kapsalon",
      "imgThumb": "/images/Kapsalon.jpg",
      "recipes": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
      "ingredient": {
        "Fries": "250 Grams",
        "Doner Meat": "500 Grams",
        "Garlic sauce": "Topping",
        "Hotsauce": "Hotsauce",
        "Lettuce": "Lettuce",
        "Tomato": "1"
      }
    },
    {
      "id": 17,
      "title": "Red Peas Soup",
      "imgThumb": "/images/Red Peas Soup.jpg",
      "recipes": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.\r\n\r\nHave your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.\r\n\r\nTime to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.\r\n\r\nIt’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.\r\n\r\nNow is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.\r\n\r\nAdd them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.\r\n\r\nYou’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.\r\n\r\nWhile this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day.",
      "ingredient": {
        "Kidney Beans": "2 cups",
        "Carrots": "1 large",
        "Spring Onions": "1/2",
        "Pepper": "pinch",
        "Garlic Clove": "2 tsp",
        "Beef": "2 tbs",
        "Water": "2 tbs",
        "Coconut Milk": "¾ tsp"
      }
    },
    {
      "id": 18,
      "title": "Peanut Butter Cheesecake",
      "imgThumb": "/images/Peanut Butter Cheesecake.jpg",
      "recipes": "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible. Melt the butter in a pan. Crush the biscuits by bashing them in a bag with a rolling pin, then stir them into the butter until very well coated. Press the mixture firmly into the base of the tin and chill.\r\nSoak the gelatine in water while you make the filling. Tip the ricotta into a bowl, then beat in the peanut butter and syrup. Ricotta has a slightly grainy texture so blitz until smooth with a stick blender for a smoother texture if you prefer.\r\nTake the soaked gelatine from the water and squeeze dry. Put it into a pan with the milk and heat very gently until the gelatine dissolves. Beat into the peanut mixture, then tip onto the biscuit base. Chill until set.\r\nTo freeze, leave in the tin and as soon as it is solid, cover the surface with cling film, then wrap the tin with cling film and foil.\r\nTo defrost, thaw in the fridge overnight.\r\nTo serve, carefully remove from the tin. Whisk the cream with the sugar until it holds its shape, then spread on top of the cheesecake and scatter with the peanut brittle.",
      "ingredient": {
        "Peanut Cookies": "1/2 bag",
        "Gelatine Leafs": "8 oz",
        "Ricotta": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 19,
      "title": "Moroccan Carrot Soup",
      "imgThumb": "/images/Moroccan Carrot Soup.jpg",
      "recipes": "Step 1\r\nPreheat oven to 180° C.\r\nStep 2\r\nCombine carrots, onion, garlic, cumin seeds, coriander seeds, salt and olive oil in a bowl and mix well. Transfer on a baking tray.\r\nStep 3\r\nPut the baking tray in preheated oven and roast for 10-12 minutes or till carrots soften. Remove from heat and cool.\r\nStep 4\r\nGrind the baked carrot mixture along with some water to make a smooth paste and strain in a bowl.\r\nStep 5\r\nHeat the carrot mixture in a non-stick pan. Add two cups of water and bring to a boil. Add garam masala powder and mix. Add salt and mix well.\r\nStep 6\r\nRemove from heat, add lemon juice and mix well.\r\nStep 7\r\nServe hot.",
      "ingredient": {
        "Carrots": "1/2 bag",
        "Prawns": "8 oz",
        "Coriander": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Garam Masala": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 20,
      "title": "Creamy Tomato Soup",
      "imgThumb": "/images/Creamy Tomato Soup.jpg",
      "recipes": "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.\r\nStir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.\r\nTo serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls.",
      "ingredient": {
        "Olive Oil": "1/2 bag",
        "Onions": "8 oz",
        "Celery": "1/2",
        "Pepper": "pinch",
        "Bay Leaf": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Vegetable Stock Cube": "¾ tsp"
      }
    },
    {
      "id": 21,
      "title": "Garides Saganaki",
      "imgThumb": "/images/Garides Saganaki.jpg",
      "recipes": "Place the prawns in a pot and add enough water to cover. Boil for 5 minutes. Drain, reserving the liquid, and set aside.\r\nHeat 2 tablespoons of oil in a saucepan. Add the onion; cook and stir until soft. Mix in the parsley, wine, tomatoes, garlic and remaining olive oil. Simmer, stirring occasionally, for about 30 minutes, or until the sauce is thickened.\r\nWhile the sauce is simmering, the prawns should become cool enough to handle. First remove the legs by pinching them, and then pull off the shells, leaving the head and tail on.\r\nWhen the sauce has thickened, stir in the prawns. Bring to a simmer again if the sauce has cooled with the prawns, and cook for about 5 minutes. Add the feta and remove from the heat. Let stand until the cheese starts to melt. Serve warm with slices of crusty bread.\r\nThough completely untraditional, you can add a few tablespoons of stock or passata to this recipe to make a delicious pasta sauce. Toss with pasta after adding the feta, and serve.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 22,
      "title": "Spanish Tortilla",
      "imgThumb": "/images/Spanish Tortilla.jpg",
      "recipes": "Put a large non-stick frying pan on a low heat. Cook the onion slowly in the oil and butter until soft but not brown – this should take about 15 mins. Add the potatoes, cover the pan and cook for a further 15-20 mins, stirring occasionally to make sure they fry evenly.\r\nWhen the potatoes are soft and the onion is shiny, crush 2 garlic cloves and stir in, followed by the beaten eggs.\r\nPut the lid back on the pan and leave the tortilla to cook gently. After 20 mins, the edges and base should be golden, the top set but the middle still a little wobbly. To turn it over, slide it onto a plate and put another plate on top, turn the whole thing over and slide it back into the pan to finish cooking. Once cooked, transfer to a plate and serve the tortilla warm or cold, scattered with the chopped parsley.\r\nTo accompany, take slices of warmed baguette, stab all over with a fork and rub with the remaining garlic, pile on grated tomatoes and season with sea salt and a drizzle of olive oil.",
      "ingredient": {
        "Onion": "1/2 bag",
        "Olive Oil": "8 oz",
        "Butter": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 23,
      "title": "Vegan Lasagna",
      "imgThumb": "/images/Vegan Lasagna.jpg",
      "recipes": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 24,
      "title": "Three-cheese souffles",
      "imgThumb": "/images/Three-cheese souffles.jpg",
      "recipes": "Heat oven to 200C/180C fan/ gas 6 and butter 4 small (about 200ml) ramekins. Sprinkle the Parmesan into the ramekins, turning until all sides are covered. Place the milk and bay leaves in a large saucepan over a gentle heat and bring to the boil. Turn off the heat and leave to infuse for 15 mins.\r\nDiscard the bay leaves, add the butter and flour, and return to a low heat. Very gently simmer, stirring continuously with a balloon whisk, for about 6 mins until you get a smooth, thick white sauce. Make sure that you get right into the corners of the pan to stop the sauce from catching or becoming lumpy.\r\nOnce thickened, transfer the sauce to a large bowl and stir in the mustard powder, cayenne pepper, Gruyère and egg yolks until fully combined.\r\nIn a spotlessly clean bowl and with a clean whisk, beat the egg whites just until peaks begin to form.\r\nCarefully fold the egg whites into the cheese sauce in three stages making sure you fold, rather than stir, to keep the egg whites light and airy. Fill the prepared ramekins with the soufflé mix.\r\nTop each soufflé with a slice of goat’s cheese, then place on a baking tray. Bake for 20-25 mins or until springy and well risen but cooked through.\r\nLeave to cool, then run a knife around the edge of each dish and remove the soufflés. If preparing in advance, place soufflés upside down (for neat presentation), on a tray. Cover tray in cling film. Chill for a few days or freeze for up to 1 month.\r\nWhen ready to re-bake, heat oven to 200C/180C fan/gas 6. Place the upside-down soufflés in a shallow baking dish, top with the remaining goat’s cheese slices and pour over the cream (this stops them from drying out when baked for the second time). Cook for 8-10 mins until golden. Serve immediately alongside some simply dressed salad.",
      "ingredient": {
        "Butter": "50g",
        "Parmesan": "25g",
        "Milk": "1/2",
        "Pepper": "pinch",
        "English Mustard": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Goats Cheese": "¾ tsp"
      }
    },
    {
      "id": 25,
      "title": "Rogaliki",
      "imgThumb": "/images/Rogaliki.jpg",
      "recipes": "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.\r\nCreate a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.\r\nTake the dough out and separate into two. Roll and cut out 3 inch trangles.\r\nMake as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.\r\nPlace the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.\r\nRepeat with the rest of the dough.\r\nWhen you take them out, put aside and sprinkle with powdered sugar on top.\r\nThis makes about 3 batches of 20 cookies each.\r\nTotal count about 60 cookies.",
      "ingredient": {
        "Beef": "1 kg",
        "Plain Flour": "2 tbs",
        "Red Wine": "200ml",
        "Beef Stock": "400ml",
        "Sesame Seed Oil": "2 tsp",
        "Green Beans": "300g",
        "Oil": "2 tbs",
        "Butter": "25g"
      }
    },
    {
      "id": 26,
      "title": "Portuguese prego",
      "imgThumb": "/images/Portuguese prego.jpg",
      "recipes": "STEP 1\r\n\r\nRub the garlic over the steaks then put in a sandwich bag and tip in the olive oil, sherry vinegar and parsley stalks. Smoosh everything together, then use a rolling pin to bash the steaks a few times. Leave for 1-2 hours.\r\n\r\nSTEP 2\r\n\r\nTo make the sauce, put all the ingredients into a blender with 1 tbsp water and whizz until as smooth as possible. This will make more than you’ll need for the recipe but will keep for a week in an airtight jar.\r\n\r\nSTEP 3\r\n\r\nHeat a griddle or frying pan to high. Brush away the garlic and parsley stalks from the steaks and season well. Sear the steaks for 2 minutes on each side then rest on a plate. Put the ciabatta halves onto the plate, toasted-side down, to soak up any juices.\r\n\r\nSTEP 4\r\n\r\nSlice the steaks then stuff into the rolls with the green sauce and rocket",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 27,
      "title": "Chelsea Buns",
      "imgThumb": "/images/Chelsea Buns.jpg",
      "recipes": "Sift the flour and salt into a large bowl. Make a well in the middle and add the yeast.\r\nMeanwhile, warm the milk and butter in a saucepan until the butter melts and the mixture is lukewarm.\r\nAdd the milk mixture and egg to the flour mixture and stir until the contents of the bowl come together as a soft dough. (You may need to add a little extra flour.)\r\nTip the dough onto a generously floured work surface. Knead for five minutes, adding more flour if necessary, until the dough is smooth and elastic and no longer feels sticky.\r\nLightly oil a bowl with a little of the vegetable oil. Place the dough into the bowl and turn until it is covered in the oil. Cover the bowl with cling film and set aside in a warm place for one hour, or until the dough has doubled in size.\r\nLightly grease a baking tray.\r\nFor the filling, knock the dough back to its original size and turn out onto a lightly floured work surface. Roll the dough out into a rectangle 0.5cm/¼in thick. Brush all over with the melted butter, then sprinkle over the brown sugar, cinnamon and dried fruit.\r\nRoll the dough up into a tight cylinder , cut ten 4cm/1½in slice and place them onto a lightly greased baking sheet, leaving a little space between each slice. Cover with a tea towel and set aside to rise for 30 minutes.\r\nPreheat oven to 190C/375F/Gas 5.\r\nBake the buns in the oven for 20-25 minutes, or until risen and golden-brown.\r\nMeanwhile, for the glaze, heat the milk and sugar in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes.\r\nRemove the buns from the oven and brush with the glaze, then set aside to cool on a wire rack.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 28,
      "title": "Tunisian Orange Cake",
      "imgThumb": "/images/Tunisian Orange Cake.jpg",
      "recipes": "Preheat oven to 190 C / Gas 5. Grease a 23cm round springform tin.\r\nCut off the hard bits from the top and bottom of the orange. Slice the orange and remove all seeds. Puree the orange with its peel in a food processor. Add one third of the sugar and the olive oil and continue to mix until well combined.\r\nSieve together flour and baking powder.\r\nBeat the eggs and the remaining sugar with an electric hand mixer for at least five minutes until very fluffy. Fold in half of the flour mixture, then the orange and the vanilla, then fold in the remaining flour. Mix well but not for too long.\r\nPour cake mixture into prepared tin and smooth out. Bake in preheated oven for 20 minutes. Reduce the oven temperature to 160 C / Gas 2 and bake again for 30 minutes Bake until the cake is golden brown and a skewer comes out clean. Cool on a wire cake rack.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 29,
      "title": "Osso Buco ",
      "imgThumb": "/images/Osso Buco.jpg",
      "recipes": "Heat the oven to 300 degrees.\r\nDredging the shanks: pour the flour into a shallow dish (a pie plate works nicely). Season the veal shanks on all sides with salt and pepper. One at a time, roll the shanks around in the flour coat, and shake and pat the shank to remove any excuses flour. Discard the remaining flour.\r\nBrowning the shanks: put the oil and 1 tablespoon of the butter in a wide Dutch oven or heavy braising pot (6 to 7 quart) and heat over medium-high heat. When the butter has melted and the oil is shimmering, lower the shanks into the pot, flat side down; if the shanks won’t fit without touching one another, do this in batches. Brown the shanks, turning once with tongs, until both flat sides are well caramelized, about 5 minutes per side. If the butter-oil mixture starts to burn, lower the heat just a bit. Transfer the shanks to a large platter or tray and set aside.\r\nThe aromatics: pour off and discard the fat from the pot. Wipe out any burnt bits with a damp paper towel, being careful not to remove any delicious little caramelized bits. Ad the remaining 2 tablespoons butter to the pot and melt it over medium heat. When the butter has stopped foaming, add the onion, carrot, celery, and fennel. Season with salt and pepper, stir, and cook the vegetables until they begin to soften but do not brown, about 6 minutes. Stir in the garlic, orange zest, marjoram, and bay leaf, and stew for another minute or two.\r\nThe braising liquid: add the wine, increase the heat to high, and bring to a boil. Boil, stirring occasionally, to reduce the wine by about half, 5 minutes. Add the stock and tomatoes, with their juice, and boil again to reduce the liquid to about 1 cup total, about 10 minutes.\r\nThe braise: Place the shanks in the pot so that they are sitting with the exposed bone facing up, and pour over any juices that accumulated as they sat. Cover with parchment paper, pressing down so the parchment nearly touches the veal and the edges hang over the sides of the pot by about an inch. Cover tightly with the lid, and slide into the lower part of the oven to braise at a gentle simmer. Check the pot after the first 15 minutes, and if the liquid is simmering too aggressively, lower the oven heat by 10 or 15 degrees. Continue braising, turning the shanks and spooning some pan juices over the top after the first 40 minutes, until the meat is completely tender and pulling away from the bone, about 2 hours.\r\nThe gremolata: While the shanks are braising, stir together the garlic, parsley, and lemon zest in a small bowl. Cover with plastic wrap and set aside in a cool place (or the refrigerator, if your kitchen is very warm.)\r\nThe finish: When the veal is fork-tender and falling away from the bone, remove the lid and sprinkle over half of the gremolata. Return the veal to the oven, uncovered, for another 15 minutes to caramelize it some.\r\nUsing a slotted spatula or spoon, carefully lift the shanks from the braising liquid, doing your best to keep them intact. The shanks will be very tender and threatening to fall into pieces, and the marrow will be wobbly inside the bones, so this can be a bit tricky. But if they do break apart, don’t worry, the flavor won’t suffer at all. Arrange the shanks on a serving platter or other large plate, without stacking, and cover with foil to keep warm.\r\nFinishing the sauce: Set the braising pot on top of the stove and evaluate the sauce: if there is a visible layer of fat floating on the surface, use a large spoon to skim it off and discard it. Taste the sauce for concentration of flavor. If it tastes a bit weak or flat, bring it to a boil over high heat, and boil to reduce the volume and intensify the flavor for 5 to 10 minutes. Taste again for salt and pepper. If the sauce wants more zip, stir in a teaspoon or two of the remaining gremolata.\r\nPortioning the veal shanks: if the shanks are reasonably sized, serve one per person. If the shanks are gargantuan or you’re dealing with modest appetites, pull apart the larger shanks, separating them at their natural seams, and serve smaller amounts. Be sure to give the marrow bones to whomever prizes them most.\r\nServing: Arrange the veal shanks on warm dinner plates accompanied by the risotto, if serving. Just before carrying the plates to the table, sprinkle on the remaining gremolata and then spoon over a generous amount of sauce – the contact with the hot liquid will aromatize the gremolata and perk up everyone’s appetite with the whiff of garlic and lemon.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 30,
      "title": "Mediterranean",
      "imgThumb": "/images/Mediterranean.jpg",
      "recipes": "Bring a large saucepan of salted water to the boil\r\nAdd the pasta, stir once and cook for about 10 minutes or as directed on the packet.\r\nMeanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil.\r\nPut the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix.\r\nWhen the pasta is ready, drain into a colander and run cold water over it to cool it quickly.\r\nToss the pasta into the salad bowl with the tomatoes and basil.\r\nAdd the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.\r\nSprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 31,
      "title": "Chilli prawn",
      "imgThumb": "/images/Chilli prawn.jpg",
      "recipes": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 32,
      "title": "Squash linguine",
      "imgThumb": "/images/Squash linguine.jpg",
      "recipes": "Heat oven to 200C/180C fan/gas 6. Put the squash and garlic on a baking tray and drizzle with the olive oil. Roast for 35-40 mins until soft. Season.\r\nCook the pasta according to pack instructions. Drain, reserving the water. Use a stick blender to whizz the squash with 400ml cooking water. Heat some oil in a frying pan, fry the sage until crisp, then drain on kitchen paper. Tip the pasta and sauce into the pan and warm through. Scatter with sage.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 33,
      "title": "Bubble & Squeak",
      "imgThumb": "/images/Bubble & Squeak.jpg",
      "recipes": "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.\r\nNext, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 34,
      "title": "Kung Pao Chicken",
      "imgThumb": "/images/Kung Pao Chicken.jpg",
      "recipes": "Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 35,
      "title": "Madeira Cake",
      "imgThumb": "/images/Madeira Cake.jpg",
      "recipes": "Pre-heat the oven to 180C/350F/Gas 4. Grease an 18cm/7in round cake tin, line the base with greaseproof paper and grease the paper.\r\nCream the butter and sugar together in a bowl until pale and fluffy. Beat in the eggs, one at a time, beating the mixture well between each one and adding a tablespoon of the flour with the last egg to prevent the mixture curdling.\r\nSift the flour and gently fold in, with enough milk to give a mixture that falls slowly from the spoon. Fold in the lemon zest.\r\nSpoon the mixture into the prepared tin and lightly level the top. Bake on the middle shelf of the oven for 30-40 minutes, or until golden-brown on top and a skewer inserted into the centre comes out clean.\r\nRemove from the oven and set aside to cool in the tin for 10 minutes, then turn it out on to a wire rack and leave to cool completely.\r\nTo serve, decorate the cake with the candied peel.",
      "ingredient": {
        "Rice Stick Noodles": "1/2 bag",
        "Prawns": "8 oz",
        "Egg": "1/2",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    },
    {
      "id": 36,
      "title": "Mince Pies",
      "imgThumb": "/images/Mince Pies.jpg",
      "recipes": "To make the pastry, rub 225g cold, diced butter into 350g plain flour, then mix in 100g golden caster sugar and a pinch of salt.\r\n\r\nCombine the pastry into a ball – don’t add liquid – and knead it briefly. The dough will be fairly firm, like shortbread dough. You can use the dough immediately, or chill for later.\r\n\r\nPreheat the oven to 200C/gas 6/fan 180C. Line 18 holes of two 12-hole patty tins, by pressing small walnut-sized balls of pastry into each hole.\r\n\r\nSpoon 280g mincemeat into the pies.\r\n\r\nTake slightly smaller balls of pastry than before and pat them out between your hands to make round lids, big enough to cover the pies. \r\n\r\nTop the pies with their lids, pressing the edges gently together to seal – you don’t need to seal them with milk or egg as they will stick on their own. (The pies may now be frozen for up to 1 month).\r\n\r\nBeat 1 small egg and brush the tops of the pies. Bake for 20 mins until golden. Leave to cool in the tin for 5 mins, then remove to a wire rack.\r\n\r\nTo serve, lightly dust with icing sugar.",
      "ingredient": {
        "Butter": "225g",
        "Plain Flour": "350g",
        "Caster Sugar": "100g",
        "Pepper": "pinch",
        "Sesame Seed Oil": "2 tsp",
        "Cornstarch": "2 tbs",
        "Oil": "2 tbs",
        "Minced Garlic": "¾ tsp"
      }
    }
  ]
}
